youxia173/KAJEN_F_CICDTest/ZigbeeMatterLight_113W/simplicity_sdk_2025.12.1/openthread/platform-abstraction/efr32/crypto.c
    case PSA_ERROR_INVALID_HANDLE:
        error = OT_ERROR_NOT_FOUND;
        break;

    case PSA_ERROR_INSUFFICIENT_DATA:
    case PSA_ERROR_INSUFFICIENT_STORAGE:
    case PSA_ERROR_INSUFFICIENT_MEMORY:
    case PSA_ERROR_BUFFER_TOO_SMALL:
        error = OT_ERROR_NO_BUFS;
        break;

    case PSA_ERROR_INVALID_SIGNATURE:
    case PSA_ERROR_DATA_CORRUPT:
    case PSA_ERROR_CORRUPTION_DETECTED:
    case PSA_ERROR_NOT_PERMITTED:
    case PSA_ERROR_INSUFFICIENT_ENTROPY:
        error = OT_ERROR_SECURITY;
        break;

    case PSA_ERROR_COMMUNICATION_FAILURE:
        error = OT_ERROR_FAILED;
        break;

    default:
        error = OT_ERROR_FAILED;
        break;
    }

    return error;
}

#if defined(SEMAILBOX_PRESENT) && !defined(SL_TRUSTZONE_NONSECURE)
static bool shouldWrap(psa_key_attributes_t *key_attr)
{
    psa_key_location_t keyLocation = PSA_KEY_LIFETIME_GET_LOCATION(psa_get_key_lifetime(key_attr));
    psa_key_type_t     keyType     = psa_get_key_type(key_attr);

    return ((keyLocation != SL_PSA_KEY_LOCATION_WRAPPED) && (keyType != PSA_KEY_TYPE_HMAC));
}

static void checkAndWrapKeys(void)
{
    for (int index = 1; index <= PERSISTENCE_KEY_ID_USED_MAX; index++)
    {
        otCryptoKeyRef       key_ref  = OPENTHREAD_CONFIG_PSA_ITS_NVM_OFFSET + index;
        psa_key_attributes_t key_attr = PSA_KEY_ATTRIBUTES_INIT;

        // If there is a key present in the location..
        if (sl_sec_man_get_key_attributes(key_ref, &key_attr) == PSA_SUCCESS)
        {
            if (shouldWrap(&key_attr))
            {
                // Wrap the key..
                otCryptoKeyRef     dst_key_ref = key_ref;
                psa_key_lifetime_t key_lifetime =
                    PSA_KEY_LIFETIME_FROM_PERSISTENCE_AND_LOCATION(PSA_KEY_PERSISTENCE_DEFAULT,
                                                                   SL_PSA_KEY_LOCATION_WRAPPED);

                psa_set_key_lifetime(&key_attr, key_lifetime);
                sl_sec_man_copy_key(key_ref, &key_attr, &dst_key_ref);
            }
        }
    }
}
#endif // SEMAILBOX_PRESENT && !SL_TRUSTZONE_NONSECURE

void otPlatCryptoInit(void)
{
#if defined(SEMAILBOX_PRESENT) && !defined(SL_TRUSTZONE_NONSECURE)
    if (sl_psa_get_most_secure_key_location() == SL_PSA_KEY_LOCATION_WRAPPED)
    {
        checkAndWrapKeys();
    }
#endif
}

static otError extractPrivateKeyFromDer(uint8_t *aPrivateKey, const uint8_t *aDer, uint8_t aDerLen)
{
    otError              error = OT_ERROR_NONE;
    mbedtls_pk_context   pk;
    mbedtls_ecp_keypair *keyPair;

    mbedtls_pk_init(&pk);

    otEXPECT_ACTION(mbedtls_pk_setup(&pk, mbedtls_pk_info_from_type(MBEDTLS_PK_ECKEY)) == 0, error = OT_ERROR_FAILED);

#if (MBEDTLS_VERSION_NUMBER >= 0x03000000)
    otEXPECT_ACTION(mbedtls_pk_parse_key(&pk, aDer, aDerLen, NULL, 0, mbedtls_psa_get_random, MBEDTLS_PSA_RANDOM_STATE)
                        == 0,
                    error = OT_ERROR_PARSE);
#else
    otEXPECT_ACTION(mbedtls_pk_parse_key(&pk, aDer, aDerLen, NULL, 0) == 0, error = OT_ERROR_PARSE);
#endif

    keyPair = mbedtls_pk_ec(pk);
    mbedtls_mpi_write_binary(&keyPair->MBEDTLS_PRIVATE(d), aPrivateKey, SL_OPENTHREAD_ECDSA_PRIVATE_KEY_SIZE);

exit:
    return error;
}

otError otPlatCryptoImportKey(otCryptoKeyRef      *aKeyId,
                              otCryptoKeyType      aKeyType,
                              otCryptoKeyAlgorithm aKeyAlgorithm,
                              int                  aKeyUsage,
                              otCryptoKeyStorage   aKeyPersistence,
                              const uint8_t       *aKey,
                              size_t               aKeyLen)
{
    otError         error = OT_ERROR_NONE;
    psa_status_t    status;
    uint8_t         aPrivateKey[SL_OPENTHREAD_ECDSA_PRIVATE_KEY_SIZE];
    const uint8_t  *keyToImport  = aKey;
    size_t          keySize      = aKeyLen;
    psa_key_usage_t keyUsageMask = 0;

    if (aKeyType == OT_CRYPTO_KEY_TYPE_ECDSA)
    {
        error       = extractPrivateKeyFromDer(aPrivateKey, aKey, aKeyLen);
        keyToImport = aPrivateKey;
        keySize     = SL_OPENTHREAD_ECDSA_PRIVATE_KEY_SIZE;
    }

#if defined(LPWAES_PRESENT) && (defined(KSU_PRESENT))
    bool is_aes_ecb_key = (aKeyType == OT_CRYPTO_KEY_TYPE_AES) && (aKeyAlgorithm == OT_CRYPTO_KEY_ALG_AES_ECB)
                          && ((aKeyUsage & OT_CRYPTO_KEY_USAGE_ENCRYPT) != 0)
                          && ((aKeyUsage & OT_CRYPTO_KEY_USAGE_DECRYPT) != 0);
    keyUsageMask = is_aes_ecb_key ? PSA_KEY_USAGE_COPY : 0;
#endif
    status = sl_sec_man_import_key(aKeyId,
                                   getPsaKeyType(aKeyType),
                                   getPsaAlgorithm(aKeyAlgorithm),
                                   getPsaKeyUsage(aKeyUsage) | keyUsageMask,
                                   getPsaKeyPersistence(aKeyPersistence),
                                   keyToImport,
                                   keySize);

    error = mapPsaStatusToOtError(status);

    return error;
}

otError otPlatCryptoExportKey(otCryptoKeyRef aKeyId, uint8_t *aBuffer, size_t aBufferLen, size_t *aKeyLen)
{
    otError      error = OT_ERROR_NONE;
    psa_status_t status;

    status = sl_sec_man_export_key(aKeyId, aBuffer, aBufferLen, aKeyLen);

    error = mapPsaStatusToOtError(status);

    return error;
}

otError otPlatCryptoDestroyKey(otCryptoKeyRef aKeyId)
{
    otError      error = OT_ERROR_NONE;
    psa_status_t status;

    status = sl_sec_man_destroy_key(aKeyId);

    error = mapPsaStatusToOtError(status);

    return error;
}

bool otPlatCryptoHasKey(otCryptoKeyRef aKeyRef)
{
    psa_key_attributes_t aAttr = PSA_KEY_ATTRIBUTES_INIT;

    return (sl_sec_man_get_key_attributes(aKeyRef, &aAttr) == PSA_SUCCESS);
}

// AES  Implementation
otError otPlatCryptoAesInit(otCryptoContext *aContext)
{
    otError error = OT_ERROR_NONE;
    (void)aContext;
    return error;
}

otError otPlatCryptoAesSetKey(otCryptoContext *aContext, const otCryptoKey *aKey)
{
    otError         error   = OT_ERROR_NONE;
    otCryptoKeyRef *mKeyRef = NULL;

    otEXPECT_ACTION((aContext != NULL) && (aContext->mContext != NULL), error = OT_ERROR_INVALID_ARGS);

    mKeyRef  = (otCryptoKeyRef *)aContext->mContext;
    *mKeyRef = aKey->mKeyRef;

